package Homework2705.Factory;
/*Створити програму яка буде описувати виробництво меблів на фабриці.
У нас будуть три варіанта меблів - Ар-деко, Вікторіанській і Модерн.
Фабрика вміє виробляти - Крісло, Диван, Столик.
Крісло, Диван, Столик - мають мати ціну - X.X, назву - "XXX".
Стпроектувати програму таким чином, щоб користувач міг вибрати який варіант меблів він хоче отримати і фабрика це зробила.
Після вибору він отримав докладний звіт.
Також передбачити умову - якщо у нас зʼявляється новий виріб - наприклад Поличка то фабрика яка виробляє меблі після
адаптації могла працювати далі і не зломати весь наш процес.*/
public abstract class Factory {
    protected String title;
    protected double price;

    public Factory(String title, double price) {
        this.title = title;
        this.price = price;

    }

}
